ERP.belugaerp/src/Catalogs/КлассификаторОрганизацийЕГАИС/КлассификаторОрганизацийЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КлассификаторОрганизацийЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодСтраны</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПредставлениеАдреса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СоответствуетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/КлассификаторОрганизацийЕГАИС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	бг_ДобавитьПолеПунктРазгрузки();
	
КонецПроцедуры

#КонецОбласти

#Область СопоставлениеПартнеров

&НаСервере
&Вместо("СопоставитьПоИННКППСервер")
Функция бг_СопоставитьПоИННКППСервер()
	
	Если Объект.СоответствуетОрганизации Тогда
		
		НайденнаяОрганизация = ИнтеграцияИС.ОрганизацияПоИННКПП(Объект.ИНН, Объект.КПП);
		Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда
			Объект.Контрагент = НайденнаяОрганизация;
		КонецЕсли;
//#Вставка
		РезультатПоиска = Неопределено;
		ИнтеграцияЕГАИСПереопределяемый.КонтрагентТорговыйОбъектПоИННКПП(РезультатПоиска, Объект.ИНН, Объект.КПП);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда		
			Объект.бг_ПунктРазгрузки = РезультатПоиска.Контрагент;			
		КонецЕсли;
//#КонецВставки		
		ПриИзмененииРеквизитаСопоставленияНаСервере();

		Возврат Истина;
		
	Иначе
		
		РезультатПоиска = Неопределено;
		ИнтеграцияЕГАИСПереопределяемый.КонтрагентТорговыйОбъектПоИННКПП(РезультатПоиска, Объект.ИНН, Объект.КПП);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			
			Объект.Контрагент     = РезультатПоиска.Контрагент;
			Объект.ТорговыйОбъект = РезультатПоиска.ТорговыйОбъект;
			
			ПриИзмененииРеквизитаСопоставленияНаСервере();
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура бг_ДобавитьПолеПунктРазгрузки()
	
	бг_ПунктРазгрузки = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПунктРазгрузки",
		Элементы.ГруппаСобственнаяОрганизацияДанные,
		"Объект.бг_ПунктРазгрузки",
		, // ТипЭлемента
		, // Элемент (предшествующий)
		"ПолеВвода");
	бг_ПунктРазгрузки.АвтоМаксимальнаяШирина = Ложь;
	бг_ПунктРазгрузки.МаксимальнаяШирина = 28;
	
КонецПроцедуры


#КонецОбласти
